# LinePattern Class

---
Represents a line pattern definition.
SystemObject Autodesk.Revit.DBLinePattern
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class LinePattern : IDisposable

    Public Class LinePattern
    	Implements IDisposable

    public ref class LinePattern : IDisposable

    type LinePattern =
        class
            interface IDisposable
        end
The LinePattern type exposes the following members.
| Name| Description
---|---|---
| LinePattern|  Creates a simple line pattern.
| LinePattern(String)|  Creates a line pattern with given name.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Name|  Line pattern name.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the LinePattern
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetSegments|  Gets the sequence of segments that defines this line pattern.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| SetSegments|
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
A line pattern is a pattern of dashes and dots used to control the way the lines of an object are drawn in Revit. Line patterns are used in the definition of GraphicsStyle objects. A line pattern is defined by a repeating sequence segments. Each segment is a dash, a dot or a space. A line pattern definition must contain an even number of segments, starting with a visible segment (a dash or a dot) and alternating between visible segments and spaces.
#### Reference
Autodesk.Revit.DB Namespace